[
  {
    "id": "highway_obstacle_01",
    "region": ["any"],
    "danger": "medium",
    "ambush": false,
    "location": "Highway",
    "description": "The highway ahead is blocked by a massive pileup. Dozens of cars crashed into each other, metal twisted and glass everywhere.",
    "choices": [
      {
        "id": "push_through",
        "text": "Push through the wreckage slowly",
        "requirements": {
          "fuel": 1
        },
        "successChance": 0.65,
        "success": {
          "fuel": -1,
          "morale": 0,
          "successNarration": "You ease the vehicle forward, nudging aside crumpled bumpers and loose glass. The engine strains, but you slip through the tightest section without drawing attention."
        },
        "failure": {
          "fuel": -1,
          "damage": "2d4",
          "morale": -10,
          "failureNarration": "The undercarriage scrapes hard against twisted metal. Something tears beneath the car—fluid starts dripping. You force through, but the damage is done."
        }
      },
      {
        "id": "scout_alternate",
        "text": "Search for an alternate route",
        "requirements": {
          "hasRole": "Scout"
        },
        "successChance": 0.85,
        "success": {
          "fuel": -1,
          "morale": 10,
          "successNarration": "The scout climbs onto a car roof, scanning the terrain. After a minute, they point to a service road half-hidden by an overpass. You take it and bypass the whole mess."
        },
        "failure": {
          "fuel": -2,
          "morale": -5,
          "failureNarration": "The detour loops back to the same highway, miles wasted. By the time you realize the mistake, fuel is low and morale lower."
        }
      },
      {
        "id": "on_foot",
        "text": "Abandon vehicle temporarily and scout ahead on foot",
        "requirements": {},
        "successChance": 0.75,
        "success": {
          "morale": -5,
          "successNarration": "You lock the doors and walk through the pileup on foot. It's nerve-wracking being exposed, but you find a clear path and guide the car through from the outside."
        },
        "failure": {
          "damage": "1d6",
          "morale": -10,
          "failureNarration": "Halfway through, movement erupts from a van. You sprint back to the car, taking a hard fall over debris. Scraped and shaken, you reverse out fast."
        }
      },
      {
        "id": "search_cars",
        "text": "Search the wrecked cars for supplies",
        "requirements": {},
        "successChance": 0.55,
        "success": {
          "food": 2,
          "fuel": 1,
          "morale": 5,
          "successNarration": "You pop trunks and check glove boxes quickly. Most are empty, but one SUV yields canned food and a half-full gas can. Small victories."
        },
        "failure": {
          "damage": "2d6",
          "morale": -15,
          "addInjuryId": "deep_cut",
          "injuryChance": 0.25,
          "failureNarration": "A jagged door panel slices deep into your forearm. Blood wells up fast. Then groaning starts—close, from multiple directions. You abandon the search and run."
        }
      }
    ]
  },
  {
    "id": "survivor_encounter_01",
    "region": ["any"],
    "danger": "medium",
    "ambush": false,
    "location": "Road",
    "description": "A lone survivor steps into the road, waving frantically. They look exhausted, desperate.",
    "choices": [
      {
        "id": "help_them",
        "text": "Stop and help them",
        "requirements": {
          "food": 2
        },
        "successChance": 0.7,
        "success": {
          "food": -2,
          "morale": 15,
          "medicine": 1,
          "successNarration": "They collapse in relief when you stop. You share food and water. In return, they hand over antibiotics from their pack—a medic, once. They nod thanks and disappear into the trees."
        },
        "failure": {
          "food": -2,
          "damage": "2d6",
          "morale": -15,
          "failureNarration": "The moment you step out, figures emerge from the ditch. The 'survivor' was bait. You throw supplies and scramble back into the car, taking hits before escaping."
        }
      },
      {
        "id": "negotiator_assess",
        "text": "Study their body language from a distance",
        "requirements": {
          "hasRole": "Negotiator"
        },
        "successChance": 0.85,
        "success": {
          "food": -1,
          "morale": 10,
          "ammo": 2,
          "successNarration": "The negotiator reads genuine fear in their posture. You slow down, crack the window. They're alone and terrified, not a threat. They trade ammunition for a little food, then vanish."
        },
        "failure": {
          "food": -1,
          "morale": -5,
          "failureNarration": "They seem genuine, but when you slow down, nothing feels right. You toss out food and keep moving. Better safe than sorry."
        }
      },
      {
        "id": "give_food",
        "text": "Toss them a small bag of food without stopping",
        "requirements": {
          "food": 1
        },
        "successChance": 1.0,
        "success": {
          "food": -1,
          "morale": 5,
          "successNarration": "You slow just enough to throw a bag out the window. They catch it and clutch it to their chest. You don't look back."
        },
        "failure": {}
      },
      {
        "id": "keep_driving",
        "text": "Keep driving—can't risk it",
        "requirements": {},
        "successChance": 1.0,
        "success": {
          "morale": -10,
          "successNarration": "You don't slow down. Their shouts fade behind you. It's the smart choice. It doesn't feel good."
        },
        "failure": {}
      }
    ]
  },
  {
    "id": "raider_ambush_01",
    "region": ["any"],
    "danger": "critical",
    "ambush": true,
    "location": "Highway",
    "description": "Gunshots crack through the air. Figures rise from behind overturned cars. A well-planned ambush with nowhere obvious to go.",
    "choices": [
      {
        "id": "soldier_returns_fire",
        "text": "Return fire immediately",
        "requirements": {
          "hasRole": "Soldier",
          "ammo": 3
        },
        "successChance": 0.75,
        "success": {
          "ammo": -3,
          "morale": 15,
          "successNarration": "The soldier leans out and fires controlled bursts. Two raiders drop. The rest scatter for cover, and you punch through the gap they left open."
        },
        "failure": {
          "ammo": -3,
          "injury": "gunshot_wound",
          "morale": -20,
          "failureNarration": "Shots echo. You return fire, but they're better positioned. A round punches through the door—pain flares. You escape bleeding, lucky to be alive."
        }
      },
      {
        "id": "fight_back",
        "text": "Open fire with whatever weapons you have",
        "requirements": {
          "ammo": 2
        },
        "successChance": 0.45,
        "success": {
          "ammo": -2,
          "morale": 10,
          "successNarration": "You fire wildly, not aiming well but making noise. It's enough—they duck for cover. You floor it and break through before they regroup."
        },
        "failure": {
          "ammo": -2,
          "damage": "4d6",
          "food": -3,
          "morale": -25,
          "failureNarration": "Bullets shatter the windshield. You fire back, but they're everywhere. The car takes heavy damage. You throw supplies out and they let you limp away, barely."
        }
      },
      {
        "id": "give_supplies",
        "text": "Throw supplies out the window and hope they let you go",
        "requirements": {
          "food": 3
        },
        "successChance": 0.8,
        "success": {
          "food": -3,
          "morale": -15,
          "successNarration": "You hurl bags of food onto the road. The shooting stops. They descend on the supplies like vultures. You drive away in the silence, humiliated but alive."
        },
        "failure": {
          "food": -3,
          "damage": "2d6",
          "morale": -25,
          "failureNarration": "You throw everything. They take it and fire anyway, laughing. Rounds punch through metal. You escape, bleeding and furious."
        }
      },
      {
        "id": "negotiator_talk",
        "text": "Shout back, trying to calm things down",
        "requirements": {
          "hasRole": "Negotiator"
        },
        "successChance": 0.6,
        "success": {
          "food": -1,
          "morale": 5,
          "successNarration": "The negotiator yells an offer—a small tribute to pass. There's a pause. Then a gruff voice: 'Leave it and go.' You do. They don't shoot."
        },
        "failure": {
          "damage": "3d6",
          "food": -3,
          "morale": -20,
          "failureNarration": "Your words mean nothing. They fire harder. You throw supplies and flee, taking hits through the broken glass."
        }
      },
      {
        "id": "run",
        "text": "Floor it and try to break through",
        "requirements": {
          "fuel": 2
        },
        "successChance": 0.55,
        "success": {
          "fuel": -2,
          "morale": -10,
          "successNarration": "You slam the pedal down. Bullets ping off metal. The engine roars and you crash through their weak side, fuel burning fast but freedom ahead."
        },
        "failure": {
          "fuel": -2,
          "damage": "3d6",
          "food": -2,
          "morale": -20,
          "failureNarration": "You accelerate, but the car takes heavy fire. Tires blow. You skid to a stop, throwing supplies to buy your escape on foot. The car is lost."
        }
      }
    ]
  },
  {
    "id": "highway_obstacle_02",
    "region": ["any"],
    "danger": "medium",
    "ambush": false,
    "location": "Highway",
    "description": "A jackknifed semi blocks most of the lanes ahead, its trailer split open and cargo spilled everywhere. Movement flickers under the trailer.",
    "choices": [
      {
        "id": "slow_weave",
        "text": "Weave slowly through the debris",
        "requirements": {
          "fuel": 1
        },
        "successChance": 0.7,
        "success": {
          "fuel": -1,
          "morale": 0,
          "successNarration": "You navigate carefully around broken pallets and spilled boxes. The shapes under the trailer don't move. You pass through quietly."
        },
        "failure": {
          "fuel": -1,
          "damage": "1d6",
          "morale": -10,
          "failureNarration": "The cargo shifts under your wheels. Something clatters loudly. Groaning starts immediately. You accelerate out, clipping debris and taking scrapes."
        }
      },
      {
        "id": "scout_on_foot",
        "text": "Dismount and guide the vehicle through on foot",
        "requirements": {},
        "successChance": 0.65,
        "success": {
          "morale": 5,
          "successNarration": "One of you walks ahead, signaling safe paths. It's slow and tense, but you thread the car through without waking anything."
        },
        "failure": {
          "damage": "1d4",
          "morale": -5,
          "failureNarration": "Halfway through, the person on foot trips over a cable. The noise echoes. Shapes stir under the truck. You both scramble back in and reverse fast."
        }
      },
      {
        "id": "scout_find_side_road",
        "text": "Look for a side road or service track",
        "requirements": {
          "hasRole": "Scout"
        },
        "successChance": 0.85,
        "success": {
          "fuel": -1,
          "morale": 10,
          "successNarration": "The scout spots an access road cutting through the median. It's rough but clear. You bypass the entire mess without incident."
        },
        "failure": {
          "fuel": -2,
          "morale": -5,
          "failureNarration": "The detour looked promising but dead-ends at a construction barrier. You backtrack, wasting fuel and time."
        }
      },
      {
        "id": "turn_back",
        "text": "Turn back and find a longer detour",
        "requirements": {
          "fuel": 2
        },
        "successChance": 1.0,
        "success": {
          "fuel": -2,
          "morale": -5,
          "successNarration": "You retreat carefully and take an exit ramp miles back. It adds an hour to the trip, but you avoid whatever was waiting under that truck."
        },
        "failure": {}
      }
    ]
  },
  {
    "id": "forest_road_01",
    "region": ["appalachian", "northwest"],
    "danger": "medium",
    "ambush": false,
    "location": "Forest Road",
    "description": "The road narrows into thick forest. Branches scrape the sides of the car. Visibility is terrible.",
    "choices": [
      {
        "id": "drive_slow_careful",
        "text": "Drive slowly and carefully through the dense trees",
        "requirements": {},
        "successChance": 0.7,
        "success": {
          "morale": 0,
          "successNarration": "You inch forward, branches scratching the paint. The forest feels claustrophobic, but you emerge into open road without incident."
        },
        "failure": {
          "damage": "1d4",
          "morale": -10,
          "failureNarration": "A fallen log hidden in shadow clips the front bumper hard. The car jolts. Something underneath scrapes badly. You limp forward, cursing."
        }
      },
      {
        "id": "scout_best_path",
        "text": "Scout ahead on foot to find the best path",
        "requirements": {
          "hasRole": "Scout"
        },
        "successChance": 0.8,
        "success": {
          "morale": 10,
          "successNarration": "The scout walks ahead, marking obstacles with rocks. You follow their path and avoid the worst hazards completely."
        },
        "failure": {
          "damage": "1d4",
          "morale": -5,
          "failureNarration": "The scout returns, but the route they marked hits a washout. You scrape through anyway, taking minor damage."
        }
      },
      {
        "id": "turn_back_forest",
        "text": "Turn back before going deeper into the forest",
        "requirements": {
          "fuel": 1
        },
        "successChance": 1.0,
        "success": {
          "fuel": -1,
          "morale": -5,
          "successNarration": "You reverse out slowly. The forest gives you a bad feeling. You find another route—longer, but safer."
        },
        "failure": {}
      },
      {
        "id": "push_through_fast",
        "text": "Floor it and push through quickly",
        "requirements": {
          "fuel": 1
        },
        "successChance": 0.5,
        "success": {
          "fuel": -1,
          "morale": 5,
          "successNarration": "You accelerate hard, branches whipping the windshield. The car takes scratches but bursts out the other side in seconds."
        },
        "failure": {
          "fuel": -1,
          "damage": "2d6",
          "morale": -15,
          "failureNarration": "You floor it, but a hidden branch smashes the side mirror off. Then the car slams into a concealed stump. Metal crunches. You limp out, shaken and damaged."
        }
      }
    ]
  },
  {
    "id": "bridge_crossing_01",
    "region": ["any"],
    "danger": "medium",
    "ambush": false,
    "location": "River Bridge",
    "description": "The bridge ahead sags in the middle. Concrete chunks have fallen into the river below. It looks unstable.",
    "choices": [
      {
        "id": "cross_slowly",
        "text": "Cross slowly, testing the weight",
        "requirements": {},
        "successChance": 0.65,
        "success": {
          "morale": 5,
          "successNarration": "You creep across, feeling every groan in the concrete. The bridge holds. You make it to the far side and breathe again."
        },
        "failure": {
          "damage": "2d6",
          "morale": -20,
          "failureNarration": "Halfway across, a section gives way. The car drops hard onto twisted rebar before catching. You scramble out and drag yourselves to solid ground, abandoning the wreck."
        }
      },
      {
        "id": "engineer_inspect",
        "text": "Engineer inspects the structure first",
        "requirements": {
          "hasRole": "Engineer"
        },
        "successChance": 0.85,
        "success": {
          "morale": 10,
          "successNarration": "The engineer walks the bridge, tapping supports. They mark a safe path along the left edge. You follow it exactly and cross without issue."
        },
        "failure": {
          "morale": -5,
          "failureNarration": "The engineer says it's too risky. You backtrack and find another crossing, losing time but avoiding disaster."
        }
      },
      {
        "id": "ford_river",
        "text": "Find a shallow point and ford the river instead",
        "requirements": {},
        "successChance": 0.6,
        "success": {
          "morale": 0,
          "successNarration": "You find a rocky ford downstream. Water splashes through the doors, but you make it across without serious damage."
        },
        "failure": {
          "damage": "1d6",
          "fuel": -1,
          "morale": -10,
          "failureNarration": "The water is deeper than it looked. The car stalls mid-river. You barely restart the engine and crawl out, soaked and shaken."
        }
      },
      {
        "id": "speed_across",
        "text": "Speed across before it can collapse",
        "requirements": {
          "fuel": 1
        },
        "successChance": 0.55,
        "success": {
          "fuel": -1,
          "morale": 5,
          "successNarration": "You gun the engine and race across. The bridge shudders but holds. You clear it in seconds, heart pounding."
        },
        "failure": {
          "fuel": -1,
          "damage": "3d6",
          "morale": -25,
          "failureNarration": "You accelerate hard, but the bridge buckles. The car slams down onto concrete chunks. You crawl out bleeding, the vehicle ruined."
        }
      }
    ]
  },
  {
    "id": "abandoned_checkpoint_01",
    "region": ["any"],
    "danger": "low",
    "ambush": false,
    "location": "Military Checkpoint",
    "description": "An abandoned military checkpoint blocks the road. Barriers are half-removed. No signs of life.",
    "choices": [
      {
        "id": "drive_through_checkpoint",
        "text": "Drive straight through the barriers",
        "requirements": {},
        "successChance": 0.8,
        "success": {
          "morale": 0,
          "successNarration": "The barriers slide aside with a scrape. No one challenges you. The checkpoint is long dead."
        },
        "failure": {
          "damage": "1d4",
          "morale": -5,
          "failureNarration": "A barrier catches the bumper and tears. You force through, dragging metal. Minor damage, but annoying."
        }
      },
      {
        "id": "search_checkpoint",
        "text": "Search the guard post for supplies",
        "requirements": {},
        "successChance": 0.6,
        "success": {
          "ammo": 2,
          "food": 1,
          "morale": 10,
          "successNarration": "You find ammunition in a locker and MREs in a desk drawer. Small finds, but they count."
        },
        "failure": {
          "morale": -5,
          "failureNarration": "The checkpoint has been picked clean. Empty lockers and broken glass. You find nothing worth taking."
        }
      },
      {
        "id": "soldier_tactical_clear",
        "text": "Soldier clears the checkpoint tactically",
        "requirements": {
          "hasRole": "Soldier"
        },
        "successChance": 0.9,
        "success": {
          "ammo": 3,
          "medicine": 1,
          "morale": 15,
          "successNarration": "The soldier methodically searches every corner. They find a hidden cache under the floorboards—ammunition, antibiotics, and sealed rations."
        },
        "failure": {
          "morale": 0,
          "failureNarration": "Even with training, the checkpoint yields nothing. It's been too thoroughly looted already."
        }
      },
      {
        "id": "bypass_checkpoint",
        "text": "Drive around it entirely",
        "requirements": {
          "fuel": 1
        },
        "successChance": 1.0,
        "success": {
          "fuel": -1,
          "morale": 0,
          "successNarration": "You take the shoulder around the checkpoint. It feels safer not to linger. You rejoin the road quickly."
        },
        "failure": {}
      }
    ]
  },
  {
    "id": "fuel_crisis_01",
    "region": ["any"],
    "danger": "low",
    "ambush": false,
    "location": "Open Road",
    "description": "The fuel gauge drops into the red. You need to find gas soon or you'll be walking.",
    "choices": [
      {
        "id": "siphon_abandoned_cars",
        "text": "Siphon fuel from abandoned cars along the roadside",
        "requirements": {},
        "successChance": 0.7,
        "success": {
          "fuel": 2,
          "morale": 5,
          "successNarration": "You find three cars with usable fuel. It's dirty work, but you collect enough to keep moving."
        },
        "failure": {
          "morale": -10,
          "failureNarration": "Every tank is bone dry or contaminated with rust. You waste an hour and gain nothing."
        }
      },
      {
        "id": "engineer_optimize",
        "text": "Engineer adjusts the engine to run leaner",
        "requirements": {
          "hasRole": "Engineer"
        },
        "successChance": 0.8,
        "success": {
          "morale": 10,
          "successNarration": "The engineer tinkers under the hood for twenty minutes. The engine runs quieter and more efficiently. You'll make it farther on what's left."
        },
        "failure": {
          "morale": -5,
          "failureNarration": "The adjustments don't help. The engine still burns fuel too fast. You're on borrowed time."
        }
      },
      {
        "id": "coast_downhill",
        "text": "Coast in neutral down hills to save fuel",
        "requirements": {},
        "successChance": 1.0,
        "success": {
          "morale": -5,
          "successNarration": "You kill the engine on every slope, letting gravity do the work. It's nerve-wracking and slow, but it stretches the tank."
        },
        "failure": {}
      },
      {
        "id": "abandon_vehicle_walk",
        "text": "Abandon the vehicle and continue on foot",
        "requirements": {},
        "successChance": 1.0,
        "success": {
          "fuel": 0,
          "morale": -15,
          "successNarration": "You leave the car on the roadside and shoulder your packs. Walking is slow, exposed, and exhausting. But you keep moving west."
        },
        "failure": {}
      }
    ]
  },
  {
    "id": "weather_storm_01",
    "region": ["any"],
    "danger": "medium",
    "ambush": false,
    "location": "Open Highway",
    "description": "Dark clouds roll in fast. Rain starts hammering the windshield. Visibility drops to almost nothing.",
    "choices": [
      {
        "id": "pull_over_wait",
        "text": "Pull over and wait for the storm to pass",
        "requirements": {},
        "successChance": 0.8,
        "success": {
          "morale": 0,
          "successNarration": "You park under an overpass and wait. The storm rages for an hour, then breaks. You continue in light drizzle."
        },
        "failure": {
          "damage": "1d4",
          "morale": -10,
          "failureNarration": "While parked, something slams into the car's roof—a branch, heavy. It dents the metal but doesn't punch through. You wait it out, shaken."
        }
      },
      {
        "id": "drive_slow_storm",
        "text": "Drive slowly through the storm",
        "requirements": {},
        "successChance": 0.6,
        "success": {
          "morale": -5,
          "successNarration": "You crawl forward at fifteen miles per hour, squinting through the downpour. It's tense and miserable, but you keep moving."
        },
        "failure": {
          "damage": "2d4",
          "fuel": -1,
          "morale": -15,
          "failureNarration": "You can't see the road. The car slides off into a ditch. It takes twenty minutes of pushing and burning fuel to get free, soaked and furious."
        }
      },
      {
        "id": "scout_sheltered_route",
        "text": "Scout for a more sheltered route",
        "requirements": {
          "hasRole": "Scout"
        },
        "successChance": 0.75,
        "success": {
          "morale": 10,
          "successNarration": "The scout finds a parallel road cutting through forest—tree cover blocks the worst of the rain. You switch routes and make good time."
        },
        "failure": {
          "fuel": -1,
          "morale": -5,
          "failureNarration": "The alternate route is washed out. You backtrack through the storm, wasting fuel and patience."
        }
      },
      {
        "id": "push_through_fast",
        "text": "Push through at speed, hoping to outrun it",
        "requirements": {
          "fuel": 1
        },
        "successChance": 0.55,
        "success": {
          "fuel": -1,
          "morale": 5,
          "successNarration": "You floor it, hydroplaning through puddles. The storm fades behind you after fifteen minutes of white-knuckle driving."
        },
        "failure": {
          "fuel": -1,
          "damage": "2d6",
          "morale": -20,
          "failureNarration": "At high speed, you hit standing water and lose control. The car spins, slamming into a guardrail. You survive, barely, but the damage is severe."
        }
      }
    ]
  },
  {
    "id": "roadblock_trap_01",
    "region": ["any"],
    "danger": "high",
    "ambush": true,
    "location": "Highway",
    "description": "A neat roadblock of sandbags and wood barriers appears ahead. Too neat. This isn't abandoned—it's a trap.",
    "choices": [
      {
        "id": "scout_observe_first",
        "text": "Scout observes from a distance before approaching",
        "requirements": {
          "hasRole": "Scout"
        },
        "successChance": 0.8,
        "success": {
          "morale": 10,
          "successNarration": "The scout spots figures hiding behind the barriers. You back up quietly before they see you, avoiding the ambush entirely."
        },
        "failure": {
          "morale": -5,
          "failureNarration": "By the time you spot the trap, they've seen you. You reverse fast, but they know you're out here now."
        }
      },
      {
        "id": "ram_through_roadblock",
        "text": "Ram through the roadblock at full speed",
        "requirements": {
          "fuel": 2
        },
        "successChance": 0.6,
        "success": {
          "fuel": -2,
          "damage": "1d6",
          "morale": 5,
          "successNarration": "You accelerate hard. The barriers explode on impact. Shouts and gunfire erupt behind you, but you're already gone."
        },
        "failure": {
          "fuel": -2,
          "damage": "4d6",
          "morale": -25,
          "failureNarration": "The barrier is reinforced underneath. You crash into it hard, the car crumpling. They descend on you before you can recover."
        }
      },
      {
        "id": "detour_offroad",
        "text": "Cut through the dirt shoulder around the blockade",
        "requirements": {},
        "successChance": 0.65,
        "success": {
          "morale": 0,
          "successNarration": "You veer onto rough ground, circling the roadblock. Shots are fired, but you're moving and they miss. You rejoin the road past the trap."
        },
        "failure": {
          "damage": "2d4",
          "morale": -15,
          "failureNarration": "The shoulder is softer than it looks. You bog down. They open fire. You escape on foot, leaving the car behind."
        }
      },
      {
        "id": "reverse_fast",
        "text": "Reverse immediately and find another route",
        "requirements": {
          "fuel": 1
        },
        "successChance": 0.75,
        "success": {
          "fuel": -1,
          "morale": -5,
          "successNarration": "You throw the car into reverse before they react. You escape cleanly and take a longer detour."
        },
        "failure": {
          "fuel": -1,
          "damage": "2d4",
          "morale": -15,
          "failureNarration": "You reverse, but not fast enough. Gunfire cracks. Rounds punch through the trunk. You escape bleeding but alive."
        }
      }
    ]
  },
  {
    "id": "zombie_horde_slow_01",
    "region": ["any"],
    "danger": "high",
    "ambush": false,
    "location": "Highway",
    "description": "A massive horde shuffles across the highway ahead. Hundreds of them, slow but relentless.",
    "choices": [
      {
        "id": "wait_them_out",
        "text": "Park and wait for them to pass",
        "requirements": {},
        "successChance": 0.7,
        "success": {
          "morale": -10,
          "successNarration": "You kill the engine and sit in silence. The horde shambles past, oblivious. It takes two hours, but they clear out."
        },
        "failure": {
          "damage": "2d4",
          "morale": -20,
          "failureNarration": "One of them notices the car. Then another. Within minutes, dozens are pounding on the doors. You restart the engine and crash through, taking damage."
        }
      },
      {
        "id": "drive_through_slowly",
        "text": "Drive through them slowly, pushing bodies aside",
        "requirements": {
          "fuel": 1
        },
        "successChance": 0.65,
        "success": {
          "fuel": -1,
          "morale": -5,
          "successNarration": "You inch forward, bumping corpses aside. They're too slow to react. You clear the horde in ten tense minutes."
        },
        "failure": {
          "fuel": -1,
          "damage": "3d6",
          "morale": -25,
          "failureNarration": "Bodies clog the wheels. The car stalls. They swarm. You restart the engine and ram through, taking heavy damage."
        }
      },
      {
        "id": "soldier_distraction",
        "text": "Soldier creates a distraction to draw them off the road",
        "requirements": {
          "hasRole": "Soldier",
          "ammo": 2
        },
        "successChance": 0.8,
        "success": {
          "ammo": -2,
          "morale": 15,
          "successNarration": "The soldier fires shots into the distance. The horde turns as one and shuffles toward the noise. You drive through the gap they leave."
        },
        "failure": {
          "ammo": -2,
          "damage": "2d4",
          "morale": -15,
          "failureNarration": "The shots draw some off, but not enough. You're forced to push through the remainder, taking hits."
        }
      },
      {
        "id": "detour_backroads",
        "text": "Find a parallel backroad to bypass the horde",
        "requirements": {
          "fuel": 2
        },
        "successChance": 0.75,
        "success": {
          "fuel": -2,
          "morale": 5,
          "successNarration": "You find a farm road cutting parallel to the highway. It adds miles but avoids the horde completely."
        },
        "failure": {
          "fuel": -2,
          "morale": -10,
          "failureNarration": "The backroad dead-ends at a locked gate. You backtrack, wasting fuel and losing time."
        }
      }
    ]
  },
  {
    "id": "medical_emergency_01",
    "region": ["any"],
    "danger": "medium",
    "ambush": false,
    "location": "Road",
    "description": "Someone's breathing is wrong. Fever spiking. You need to deal with this now or it'll get worse.",
    "choices": [
      {
        "id": "medic_treat_roadside",
        "text": "Medic treats them by the roadside immediately",
        "requirements": {
          "hasRole": "Medic",
          "medicine": 1
        },
        "successChance": 0.85,
        "success": {
          "medicine": -1,
          "morale": 15,
          "successNarration": "The medic works fast—antibiotics, bandage change, fluids. The fever breaks within an hour. Crisis averted."
        },
        "failure": {
          "medicine": -1,
          "damage": "1d4",
          "morale": -10,
          "failureNarration": "The medic tries, but the fever doesn't break. They're weak and getting weaker. You keep moving, hoping to find better shelter."
        }
      },
      {
        "id": "push_to_shelter",
        "text": "Push hard to reach the next town for shelter",
        "requirements": {
          "fuel": 1
        },
        "successChance": 0.6,
        "success": {
          "fuel": -1,
          "morale": 5,
          "successNarration": "You drive fast, reaching an abandoned clinic. It has running water and a clean room. They rest and recover overnight."
        },
        "failure": {
          "fuel": -1,
          "damage": "2d4",
          "morale": -20,
          "failureNarration": "You race toward town, but they collapse in the back seat before you arrive. You pull over in panic, barely stabilizing them."
        }
      },
      {
        "id": "rest_and_monitor",
        "text": "Pull over and rest, monitoring them closely",
        "requirements": {},
        "successChance": 0.5,
        "success": {
          "morale": -5,
          "successNarration": "You park in shade and wait. After a few hours, the fever breaks naturally. They're weak but stable."
        },
        "failure": {
          "damage": "2d6",
          "morale": -25,
          "failureNarration": "Their condition worsens rapidly. Without medicine, there's little you can do. They survive, but barely."
        }
      },
      {
        "id": "keep_driving_hope",
        "text": "Keep driving and hope they tough it out",
        "requirements": {},
        "successChance": 0.4,
        "success": {
          "morale": -10,
          "successNarration": "They grit through it, miserable and pale. By nightfall, the fever has lessened. They'll live."
        },
        "failure": {
          "damage": "3d6",
          "morale": -30,
          "failureNarration": "You push too hard. They deteriorate fast, nearly dying in the back seat. You're forced to stop and stabilize them, losing precious time."
        }
      }
    ]
  },
  {
    "id": "scavenge_opportunity_01",
    "region": ["any"],
    "danger": "low",
    "ambush": false,
    "location": "Rural Road",
    "description": "An overturned delivery truck sits on the shoulder. The back doors are open and boxes are scattered.",
    "choices": [
      {
        "id": "quick_grab",
        "text": "Quick grab of the most obvious supplies",
        "requirements": {},
        "successChance": 0.75,
        "success": {
          "food": 2,
          "morale": 5,
          "successNarration": "You snatch a few intact boxes—canned goods and bottled water. You're in and out in two minutes."
        },
        "failure": {
          "morale": -5,
          "failureNarration": "The boxes are empty or spoiled. You find nothing worth taking."
        }
      },
      {
        "id": "thorough_search",
        "text": "Search thoroughly for valuable items",
        "requirements": {},
        "successChance": 0.6,
        "success": {
          "food": 3,
          "medicine": 1,
          "morale": 10,
          "successNarration": "You dig deep into the cargo. Most is ruined, but you find sealed food and a first aid kit buried under debris."
        },
        "failure": {
          "damage": "1d6",
          "morale": -10,
          "failureNarration": "You're elbow-deep in boxes when groaning starts nearby. You scramble out, cutting yourself on broken glass in the rush."
        }
      },
      {
        "id": "scout_perimeter_first",
        "text": "Scout checks the perimeter for threats first",
        "requirements": {
          "hasRole": "Scout"
        },
        "successChance": 0.9,
        "success": {
          "food": 3,
          "morale": 15,
          "successNarration": "The scout confirms it's clear. You search methodically and safely, loading the car with supplies without incident."
        },
        "failure": {
          "morale": 0,
          "failureNarration": "The scout gives the all-clear, but there's not much left to take. Someone else got here first."
        }
      },
      {
        "id": "ignore_move_on",
        "text": "Ignore it and keep moving—probably a trap",
        "requirements": {},
        "successChance": 1.0,
        "success": {
          "morale": -5,
          "successNarration": "You don't trust it. Too convenient. You drive past and keep watching the mirrors. Nothing follows."
        },
        "failure": {}
      }
    ]
  },
  {
    "id": "night_travel_01",
    "region": ["any"],
    "danger": "high",
    "ambush": false,
    "location": "Highway",
    "description": "Night has fallen and you're still on the road. Driving in the dark is dangerous—but stopping might be worse.",
    "choices": [
      {
        "id": "drive_headlights_off",
        "text": "Drive with headlights off to avoid detection",
        "requirements": {},
        "successChance": 0.6,
        "success": {
          "morale": -5,
          "successNarration": "You navigate by moonlight, creeping forward at twenty miles per hour. It's terrifying, but nothing spots you."
        },
        "failure": {
          "damage": "2d6",
          "morale": -20,
          "failureNarration": "You can't see the road. The car slams into an unseen obstacle—hard. Metal crunches. You're forced to stop and assess damage."
        }
      },
      {
        "id": "drive_slow_headlights",
        "text": "Drive slowly with headlights on",
        "requirements": {},
        "successChance": 0.7,
        "success": {
          "morale": 0,
          "successNarration": "You keep the headlights on and drive cautiously. The beams feel like spotlights, but you make steady progress."
        },
        "failure": {
          "damage": "1d6",
          "morale": -15,
          "failureNarration": "Shapes appear in the headlights—too many, too fast. You swerve hard, clipping something. You escape but the car is scratched up."
        }
      },
      {
        "id": "pull_over_sleep",
        "text": "Pull over and sleep until dawn",
        "requirements": {},
        "successChance": 0.65,
        "success": {
          "morale": 5,
          "successNarration": "You find a hidden spot off the road and lock the doors. The night passes uneventfully. You wake stiff but rested."
        },
        "failure": {
          "damage": "1d4",
          "morale": -15,
          "failureNarration": "Something pounds on the car in the middle of the night. You wake in terror, engine roaring as you escape into the dark."
        }
      },
      {
        "id": "scout_safe_spot",
        "text": "Scout finds a defensible spot to camp overnight",
        "requirements": {
          "hasRole": "Scout"
        },
        "successChance": 0.85,
        "success": {
          "morale": 10,
          "successNarration": "The scout locates an overpass with good sightlines. You park underneath and take turns on watch. The night passes quietly."
        },
        "failure": {
          "morale": -5,
          "failureNarration": "The 'safe' spot turns out to be near a nest of infected. You relocate twice before finding real shelter, exhausted."
        }
      }
    ]
  },
  {
    "id": "refugee_camp_01",
    "region": ["any"],
    "danger": "medium",
    "ambush": false,
    "location": "Highway Rest Stop",
    "description": "A makeshift refugee camp occupies a rest stop. Dozens of people living in tents and cars. They watch you approach warily.",
    "choices": [
      {
        "id": "trade_with_camp",
        "text": "Approach peacefully and offer to trade",
        "requirements": {
          "food": 2
        },
        "successChance": 0.7,
        "success": {
          "food": -2,
          "fuel": 2,
          "morale": 10,
          "successNarration": "You trade food for fuel and information. They're grateful for fresh supplies. One elder points you toward a safer route west."
        },
        "failure": {
          "food": -2,
          "morale": -10,
          "failureNarration": "They take the food but give you almost nothing in return. Desperate people, desperate times. You leave feeling cheated."
        }
      },
      {
        "id": "negotiator_build_rapport",
        "text": "Negotiator builds rapport with camp leaders",
        "requirements": {
          "hasRole": "Negotiator"
        },
        "successChance": 0.8,
        "success": {
          "medicine": 1,
          "ammo": 1,
          "morale": 15,
          "successNarration": "The negotiator earns their trust. They share medicine and ammunition in exchange for news from the road. Everyone wins."
        },
        "failure": {
          "morale": -5,
          "failureNarration": "The camp leaders are too paranoid to trust outsiders. You leave without incident, but without help."
        }
      },
      {
        "id": "drive_through_camp",
        "text": "Drive through without stopping",
        "requirements": {},
        "successChance": 0.8,
        "success": {
          "morale": 0,
          "successNarration": "You roll through slowly, making eye contact with no one. They let you pass. The tension is thick but you avoid confrontation."
        },
        "failure": {
          "morale": -10,
          "failureNarration": "Someone throws a rock at the car as you pass. Others shout curses. You accelerate out, shaken by the hostility."
        }
      },
      {
        "id": "avoid_camp_detour",
        "text": "Detour around the camp entirely",
        "requirements": {
          "fuel": 1
        },
        "successChance": 1.0,
        "success": {
          "fuel": -1,
          "morale": -5,
          "successNarration": "You take a side road around the camp. Better safe than sorry. You lose some time but avoid potential trouble."
        },
        "failure": {}
      }
    ]
  },
  {
    "id": "zombie_horde_ambush_03",
    "region": ["plains", "midwest"],
    "danger": "high",
    "ambush": true,
    "location": "Rural Highway",
    "description": "A long line of abandoned cars leads into a low dip in the road. As you inch forward, heads begin to rise between the vehicles. The horde was sleeping in the shade.",
    "choices": [
      {
        "id": "u_turn_fast",
        "text": "Perform a fast U-turn and flee",
        "requirements": {
          "fuel": 1
        },
        "successChance": 0.7,
        "success": {
          "fuel": -1,
          "morale": -5,
          "successNarration": "You crank the wheel hard and reverse. The tires squeal. Behind you, the horde rises fully, but you're already speeding away."
        },
        "failure": {
          "fuel": -1,
          "damage": "2d4",
          "morale": -20,
          "failureNarration": "The U-turn is too slow. They swarm the car before you complete it. You ram through, taking damage, and escape barely."
        }
      },
      {
        "id": "slow_crawl_silent",
        "text": "Crawl forward as quietly as possible",
        "requirements": {},
        "successChance": 0.6,
        "success": {
          "morale": -5,
          "successNarration": "You inch forward, engine barely idling. They stir but don't fully wake. You clear the dip without triggering the horde."
        },
        "failure": {
          "damage": "2d4",
          "morale": -15,
          "failureNarration": "A tire bumps a car door—loud. The horde erupts. You floor it, crashing through, taking hits on all sides."
        }
      },
      {
        "id": "soldier_decoy",
        "text": "Toss noise-making decoys to draw them away",
        "requirements": {
          "hasRole": "Soldier",
          "ammo": 1
        },
        "successChance": 0.75,
        "success": {
          "ammo": -1,
          "morale": 10,
          "successNarration": "The soldier tosses a firecracker into the distance. It pops loudly. The horde shambles toward the noise. You drive through the gap they leave."
        },
        "failure": {
          "ammo": -1,
          "damage": "2d6",
          "morale": -20,
          "failureNarration": "The decoy doesn't draw enough of them. You're forced to ram through the remainder, taking heavy damage."
        }
      },
      {
        "id": "leave_road_cut_field",
        "text": "Cut across a nearby field, avoiding the jam entirely",
        "requirements": {
          "fuel": 1
        },
        "successChance": 0.7,
        "success": {
          "fuel": -1,
          "morale": 0,
          "successNarration": "You veer off-road into a cornfield. The car bounces over rough ground, but you circle the entire horde and rejoin the highway past them."
        },
        "failure": {
          "fuel": -1,
          "damage": "2d4",
          "morale": -10,
          "failureNarration": "The field is softer than it looks. The car bogs down. You barely get free before the horde reaches you, escaping with damage."
        }
      }
    ]
  },
  {
    "id": "hostile_group_ambush_01",
    "region": ["appalachian"],
    "danger": "high",
    "ambush": true,
    "location": "Mountain Switchback",
    "description": "At a tight bend, a pickup blocks the outside lane and locals with hunting rifles step out from the treeline. Their faces are hard and territorial.",
    "choices": [
      {
        "id": "talk_local_rules",
        "text": "Ask about their rules and offer to pay a toll",
        "requirements": {
          "hasRole": "Negotiator",
          "food": 2
        },
        "successChance": 0.7,
        "success": {
          "food": -2,
          "morale": -5,
          "successNarration": "The negotiator talks calmly. After a tense exchange, they accept food as toll. You're allowed to pass, humiliated but alive."
        },
        "failure": {
          "food": -2,
          "damage": "2d4",
          "morale": -20,
          "failureNarration": "They take the food and fire a warning shot anyway. You scramble into the car and flee, bullets whizzing past."
        }
      },
      {
        "id": "force_through_edge",
        "text": "Edge past them dangerously close to the cliff",
        "requirements": {
          "fuel": 1
        },
        "successChance": 0.55,
        "success": {
          "fuel": -1,
          "morale": -5,
          "successNarration": "You hug the cliff edge, tires on gravel. They shout but don't shoot. You scrape past their truck and accelerate down the switchback."
        },
        "failure": {
          "fuel": -1,
          "damage": "4d6",
          "morale": -25,
          "failureNarration": "The edge gives way. The car slides sideways, teetering. You overcorrect and crash into their truck. They drag you out bleeding."
        }
      },
      {
        "id": "soldier_show_force",
        "text": "Step out visibly armed but not aiming",
        "requirements": {
          "hasRole": "Soldier"
        },
        "successChance": 0.65,
        "success": {
          "morale": 10,
          "successNarration": "The soldier steps out calmly, rifle visible. There's a long silence. Then one of them nods. They let you pass. Respect earned."
        },
        "failure": {
          "damage": "2d6",
          "morale": -20,
          "failureNarration": "They see the rifle as a challenge. Shots ring out. You dive back into the car and flee, taking hits."
        }
      },
      {
        "id": "retreat_switchback",
        "text": "Carefully reverse down the switchback out of range",
        "requirements": {},
        "successChance": 0.7,
        "success": {
          "morale": -10,
          "successNarration": "You reverse slowly, hands visible. They watch but don't pursue. You find another route, hours lost but alive."
        },
        "failure": {
          "damage": "2d4",
          "morale": -15,
          "failureNarration": "Halfway down, they fire. Rounds crack past. You accelerate in reverse, clipping the cliff wall. You escape damaged."
        }
      }
    ]
  },
  {
    "id": "hostile_group_ambush_02",
    "region": ["any"],
    "danger": "critical",
    "ambush": true,
    "location": "Abandoned Toll Plaza",
    "description": "As the vehicle enters the toll plaza, floodlights flare to life from a generator. Armed survivors step out from booths, weapons aimed. The gates slam shut behind you.",
    "choices": [
      {
        "id": "negotiate_exit_fee",
        "text": "Quickly offer a heavy toll of supplies",
        "requirements": {
          "hasRole": "Negotiator",
          "food": 3
        },
        "successChance": 0.7,
        "success": {
          "food": -3,
          "morale": -10,
          "successNarration": "The negotiator shouts an offer through the window. After a tense pause, they accept. The gate opens. You drive through, stripped but alive."
        },
        "failure": {
          "food": -3,
          "ammo": -2,
          "morale": -25,
          "failureNarration": "They take the food, then demand more. You throw ammunition too. They laugh as you crawl away, humiliated and broke."
        }
      },
      {
        "id": "smash_gate",
        "text": "Ram the front gate and try to break out",
        "requirements": {
          "fuel": 2
        },
        "successChance": 0.55,
        "success": {
          "fuel": -2,
          "damage": "2d4",
          "morale": -10,
          "successNarration": "You gun the engine and hit the gate hard. It buckles. Metal screeches. You crash through into open road, the car dented but functional."
        },
        "failure": {
          "fuel": -2,
          "damage": "4d6",
          "morale": -30,
          "failureNarration": "The gate is reinforced. You hit it and bounce back. Gunfire erupts. The car is shredded. You abandon it and flee on foot."
        }
      },
      {
        "id": "fight_booths",
        "text": "Open fire on the nearest booths and sprint for the exit",
        "requirements": {
          "ammo": 3
        },
        "successChance": 0.5,
        "success": {
          "ammo": -3,
          "morale": -5,
          "successNarration": "You fire at the floodlights, plunging the plaza into darkness. In the chaos, you ram the gate and escape."
        },
        "failure": {
          "ammo": -3,
          "injury": "gunshot_wound",
          "morale": -30,
          "failureNarration": "They return fire immediately. A round punches through your shoulder. You drop the gun, bleeding. You barely escape alive."
        }
      },
      {
        "id": "abandon_vehicle_climb",
        "text": "Climb the toll structure and escape over the side on foot",
        "requirements": {},
        "successChance": 0.55,
        "success": {
          "morale": -15,
          "successNarration": "You scramble up the toll booth roof and drop over the far side. They're too slow to react. You lose the car, but you live."
        },
        "failure": {
          "damage": "3d6",
          "morale": -30,
          "failureNarration": "You climb, but they shoot. You fall hard from the roof, landing wrong. You crawl away bleeding, the car lost forever."
        }
      }
    ]
  },
  {
    "id": "animal_attack_ambush_01",
    "region": ["plains", "midwest"],
    "danger": "high",
    "ambush": true,
    "location": "Rural Road",
    "description": "As night falls, eyes glint on the roadside. A pack of feral dogs sprints from the ditch, leaping at the car doors.",
    "choices": [
      {
        "id": "accelerate_through_pack",
        "text": "Accelerate and try to outrun the pack",
        "requirements": {
          "fuel": 1
        },
        "successChance": 0.7,
        "success": {
          "fuel": -1,
          "damage": "1d4",
          "morale": -5,
          "successNarration": "You floor it. Dogs slam into the sides, snarling. One clings to the bumper before falling off. You leave them in the dust."
        },
        "failure": {
          "fuel": -1,
          "damage": "3d6",
          "morale": -20,
          "failureNarration": "They're too fast. One shatters the side window. Teeth and fur everywhere. You swerve wildly, crashing into a ditch before escaping."
        }
      },
      {
        "id": "fire_warning_shots",
        "text": "Lean out and fire warning shots into the air",
        "requirements": {
          "ammo": 1
        },
        "successChance": 0.75,
        "success": {
          "ammo": -1,
          "morale": 5,
          "successNarration": "You fire twice into the sky. The pack scatters instantly, terrified by the gunfire. You drive away in sudden quiet."
        },
        "failure": {
          "ammo": -1,
          "damage": "2d4",
          "morale": -15,
          "failureNarration": "The shots don't scare them. They attack harder. You waste ammunition and take bites before escaping."
        }
      },
      {
        "id": "stay_still_wait",
        "text": "Stay inside, keep still, and wait for them to lose interest",
        "requirements": {},
        "successChance": 0.6,
        "success": {
          "morale": -5,
          "successNarration": "You lock the doors and sit in silence. They circle the car, snarling. After twenty tense minutes, they wander off."
        },
        "failure": {
          "damage": "2d4",
          "morale": -15,
          "failureNarration": "They don't lose interest. One finds a crack in the door seal and bites through. You panic, starting the engine and fleeing."
        }
      },
      {
        "id": "fight_them_off_melee",
        "text": "Open a door briefly and try to scare them off at close range",
        "requirements": {},
        "successChance": 0.55,
        "success": {
          "morale": -5,
          "successNarration": "You crack the door, kick hard at the nearest dog. It yelps and the pack backs off. You slam the door and drive."
        },
        "failure": {
          "morale": -20,
          "addInjuryId": "deep_cut",
          "injuryChance": 0.6,
          "failureNarration": "The moment the door opens, they surge. Teeth sink into your leg. You scream, kick free, and slam the door. Blood everywhere."
        }
      }
    ]
  }
]